require("Envir/Market_Def/zh.lua") --个人封装函数
-- 名称，增幅概率，增幅材料1id，增幅材料1名称，增幅材料1数量，增幅材料2id,增幅材料2名称，增幅材料2数量，自定义属性表id,属性id，属性值，属性名称
local data = {
    [4] = {
        [0] = { "头盔0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 4, 1, "攻击", 19, 1000, 0 },
        { "头盔1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 4, 2, "攻击", 19, 1000, 0 },
        { "头盔2", 60, 7, "金币", 60000, 10240, "三级金针", 300, 1, 4, 3, "攻击", 19, 1000, 0 },
        { "头盔3", 60, 7, "金币", 80000, 10241, "四级金针", 400, 1, 4, 4, "攻击", 19, 1000, 0 },
        { "头盔4", 60, 7, "金币", 100000, 10242, "五级金针", 500, 1, 4, 5, "攻击", 19, 1000, 0 },
        { "头盔5", 60, 7, "金币", 120000, 10243, "六级金针", 600, 1, 4, 6, "攻击", 19, 1000, 0 },
        { "头盔6", 60, 7, "金币", 140000, 10244, "七级金针", 700, 1, 4, 7, "攻击", 19, 1000, 0 },
        { "头盔7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 1, 4, 8, "攻击", 19, 1000, 0 }
    },
    [3] = {
        [0] = { "项链0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 12, 1, 10, "生命值", 19, 1000, 0 },
        { "项链1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 12, 1, 20, "生命值", 19, 1000, 0 },
        { "项链2", 60, 7, "金币", 60000, 10240, "三级金针", 300, 12, 1, 30, "生命值", 19, 1000, 0 },
        { "项链3", 50, 7, "金币", 80000, 10241, "四级金针", 400, 12, 1, 40, "生命值", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [6] = {
        [0] = { "左手0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "左手1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "左手2", 60, 7, "金币", 60000, 10240, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "左手3", 50, 7, "金币", 80000, 10241, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [5] = {
        [0] = { "右手0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "右手1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "右手2", 60, 7, "金币", 60000, 10240, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "右手3", 50, 7, "金币", 80000, 10241, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [8] = {
        [0] = { "左戒0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "左戒1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "左戒2", 60, 7, "金币", 60000, 10240, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "左戒3", 50, 7, "金币", 80000, 10241, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [7] = {
        [0] = { "右戒0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "右戒1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "右戒2", 60, 7, "金币", 60000, 10016, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "右戒3", 50, 7, "金币", 80000, 10016, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [10] = {
        [0] = { "腰带0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "腰带1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "腰带2", 60, 7, "金币", 60000, 10016, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "腰带3", 50, 7, "金币", 80000, 10016, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [11] = {
        [0] = { "靴子0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "靴子1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "靴子2", 60, 7, "金币", 60000, 10016, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "靴子3", 50, 7, "金币", 80000, 10016, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [1] = {
        [0] = { "武器0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "武器1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "武器2", 60, 7, "金币", 60000, 10016, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "武器3", 50, 7, "金币", 80000, 10016, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
    [0] = {
        [0] = { "衣服0", 100, 7, "金币", 20000, 10238, "一级金针", 100, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "衣服1", 70, 7, "金币", 40000, 10239, "二级金针", 200, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "衣服2", 60, 7, "金币", 60000, 10016, "三级金针", 300, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "衣服3", 50, 7, "金币", 80000, 10016, "四级金针", 400, 1, 35, 35, "攻击", 19, 1000, 0 },
        { "项链4", 50, 7, "金币", 100000, 10242, "五级金针", 500, 12, 1, 50, "生命值", 19, 1000, 0 },
        { "项链5", 50, 7, "金币", 120000, 10243, "六级金针", 600, 12, 1, 60, "生命值", 19, 1000, 0 },
        { "项链6", 50, 7, "金币", 140000, 10244, "七级金针", 700, 12, 1, 70, "生命值", 19, 1000, 0 },
        { "项链7", 50, 7, "金币", 160000, 10245, "八级金针", 800, 12, 1, 80, "生命值", 19, 1000, 0 }
    },
}

local shengji_t = {
    [4] = '头盔增幅等级',
    [3] = '项链增幅等级',
    [6] = '左手增幅等级',
    [5] = '右手增幅等级',
    [8] = '左戒增幅等级',
    [7] = '右戒增幅等级',
    [10] = '腰带增幅等级',
    [11] = '靴子增幅等级',
    [1] = '武器增幅等级',
    [0] = '衣服增幅等级'
}

function show(actor, weizhiName, zengfuIconId, weizhi)
    weizhiName = weizhiName or '头盔'
    zengfuIconId = tonumber(zengfuIconId) or 1
    weizhi = tonumber(weizhi) or 4
    local msg = [[
			<Img|x=-0.5|y=0.0|bg=1|show=4|reload=1|esc=1|img=custom/npc/zbzf/111.png|move=1|reset=1>
			<Layout|x=703.5|y=18.0|width=40|height=40|link=@exit>
			<Button|x=734.0|y=-6.0|nimg=public/000001.png|color=255|size=18|link=@exit>
			<Layout|x=406.0|y=133.0|width=325|height=67|color=0>
			<EquipShow|x=57.0|y=147.0|scale=1|bgtype=0|index=4|showtips=0|link=@show,头盔,1,4>
			<EquipShow|x=289.0|y=144.0|scale=1|bgtype=0|index=3|showtips=0|link=@show,项链,2,3>
			<EquipShow|x=25.0|y=211.0|scale=1|bgtype=0|index=6|showtips=0|link=@show,左手,3,6>
			<EquipShow|x=319.0|y=210.0|scale=1|bgtype=0|index=5|showtips=0|link=@show,右手,4,5>
			<EquipShow|x=22.0|y=275.0|scale=1|bgtype=0|index=8|showtips=0|link=@show,左戒,5,8>
			<EquipShow|x=319.0|y=276.0|scale=1|bgtype=0|index=7|showtips=0|link=@show,右戒,6,7>
			<EquipShow|x=46.0|y=342.0|scale=1|bgtype=0|index=10|showtips=0|link=@show,腰带,7,10>
			<EquipShow|x=296.0|y=341.0|scale=1|bgtype=0|index=11|showtips=0|link=@show,靴子,8,11>
			<EquipShow|x=110.0|y=376.0|scale=1|bgtype=0|index=1|showtips=0|link=@show,武器,9,1>
			<EquipShow|x=237.0|y=378.0|scale=1|bgtype=0|index=0|showtips=0|link=@show,衣服,10,0>
			
			]]
    msg = msg .. '<EquipShow|x=173.0|y=248.0|scale=1|bgtype=0|index=' .. weizhi .. '|showtips=1>'


    local weizhilevel = getint(actor, shengji_t[weizhi])
    local zengfuData = data[weizhi][weizhilevel + 1]

    msg = msg ..
        '<ItemShow|x=485.0|y=325.0|itemid=' ..
        zengfuData[3] .. '|itemcount=' .. zengfuData[5] .. '|scale=1.0|showtips=1|bgtype=0>'
    msg = msg ..
        '<ItemShow|x=575.0|y=323.0|itemid=' ..
        zengfuData[6] .. '|itemcount=' .. zengfuData[8] .. '|scale=1.0|showtips=1|bgtype=0>'
    msg = msg ..
        '<RText|x=518.0|y=398.0|outline=1|size=18|color=255|text=<成功几率/FCOLOR=21><' ..
        zengfuData[2] .. '%/FCOLOR=250>>'

    msg = msg ..
        '<Button|id=b0|x=495.0|y=424.0|size=18|clickInterval=300|color=255|nimg=custom/npc/zbzf/222.png|link=@exec,' ..
        weizhi .. ',' .. weizhilevel .. ',' .. weizhiName .. '>'
    msg = msg .. '<RText|x=240.0|y=454.0|outline=1|size=15|color=255|text=<' .. weizhilevel .. '次/FCOLOR=95>>'
    say(actor, msg)
end

function exec(actor, weizhi, weizhilevel, weizhiName)
    weizhi = tonumber(weizhi)
    weizhilevel = tonumber(weizhilevel)

    if weizhilevel >= 8 then
        sendmsg9(actor, "当前装备位置的等级已达最高级")
        return
    end
    local zengfuData = data[weizhi][weizhilevel + 1]
    if getbindgold(actor) < zengfuData[5] then
        sendmsg9(actor, "金币不足" .. tostring(zengfuData[5]))
        return
    end
    if itemcount(actor, zengfuData[7]) < zengfuData[8] then
        sendmsg9(actor, zengfuData[7] .. "不足" .. tostring(zengfuData[8]))
        return
    end

    changemoney(actor, zengfuData[3], "-", zengfuData[5], "", true)
    takeitem(actor, zengfuData[7], zengfuData[8])

    if math.random(1, 100) > zengfuData[2] then
        sendmsg9(actor, "装备增幅失败")
        return
    end

    local item = linkbodyitem(actor, weizhi)
    local itemName = getitemname(actor, item)
    local tbl = {
        ["abil"] = {
            {
                ["i"] = 0,
                ["t"] = "[装备增幅]",
                ["c"] = 251,
                ["v"] = {
                    { 0, zengfuData[10], zengfuData[11], 0, zengfuData[9], 1, 1 },
                    -- {0,zengfuData[9],zengfuData[10],0,zengfuData[8],2,2},
                },
            },
        },
        ["name"] = itemName .. "[增幅 + " .. weizhilevel + 1 .. "]",
    }

    setitemcustomabil(actor, item, tbl2json(tbl))
    refreshitem(actor, item)

    setint(actor, shengji_t[weizhi], getint(actor, shengji_t[weizhi]) + 1)
    sendmsg9(actor, "装备增幅成功!")
    show(actor, weizhiName, 0, weizhi)
end
